finished playwright-e2e tests
